import styled from "styled-components";
import Header from "../global/Header";

export default function Service() {
  const HTML = `
<pre
style="
white-space: pre-wrap;
font-family: PretendardRegular;
color: #808080;
font-size: 13px;
"
>
제 1장. 총칙

제 1조. 목적

마이플랜잇 서비스 약관(이하 “본 약관”)은 주식회사 마이플랜잇(이하 회사)가 제공하는 마이플랜잇(https://myplanit.site 이하 “마이플랜잇”) 서비스를 이용함에 있어 회원과 회사 간의 권리, 의무, 책임사항 및 회원의 서비스 이용절차 등에 관한 사항을 규정함을 목적으로 합니다.


제 2조. 정의

(1) 본 약관의 용어 정의는 다음 각 호와 같습니다.
1. 서비스 : 마이플랜잇에서 제공하거나, 마이플랜잇과 직접 연동되어 제공되는 서비스
2. 회원 : 마이플랜잇의 회원가입절차를 거친 후, 마이플랜잇이 제공하는 서비스를 이용하는 자
3. 회원ID: 회원 식별과 서비스 이용을 위하여 마이플랜잇 회원임을 확인하고 회원 자신의 비밀보호를 위해 회원자신이 선정하고 마이플랜잇이 승인하는 문자와 숫자의 조합
4. 비밀번호: 마이플랜잇 회원이 부여 받은 회원ID와 일치된 회원임을 확인하고 자신의 비밀 보호를 위해 회원이 설정한 문자와 숫자의 조합
(2) 제 1항에서 정의되지 않은 용어의 의미는 관련 법령 및 일반적인 거래관행을 따릅니다.


제 3조 (적용 범위 및 효력 우선순위)

(1) 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을 발생합니다.
(2) 제1장 및 제2장의 규정과 개별서비스 관련 규정이 상충할 때에는 개별서비스 관련 규정이 전체서비스 관련 규정(제1장 및 제2장)보다 우선적인 효력을 갖습니다.


제 4조 (약관의 명시, 효력 및 변경)

(1) 회사는 정의된 약관을 회원이 알 수 있도록 마이플랜잇의 첫 화면에 게시합니다.
(2) 회사는 합리적인 사유가 발생하면 약관의 규제에 관한 법률에 위배되지 않는 범위 안에서 이 약관을 변경 할 수 있으며, 회사가 약관을 변경할 때에는 적용일자와 변경사유를 밝혀 그 적용일자 15일 전부터 마이플랜잇에서 공지합니다. 다만, 회원에게 불리한 약관을 변경할 때에는 해당 내용을 그 적용일자 30일 전부터 공지하며, 이메일(e-mail) 등으로 회원에게 개별 통지합니다(회원의 연락처 미기재, 변경 등으로 개별 통지가 어려울 때에는 본 약관에 따라 공지를 하는 것을 개별 통지한 것으로 간주합니다).
(3) 이 약관에 동의하는 것은 정기적으로 회사가 운영하는 마이플랜잇을 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대해 회사는 책임을 지지 않습니다.
(4) 변경된 약관에 동의하지 않는 회원은 회원 탈퇴(이용계약의 해지)를 요청할 수 있으며, 회사가 제2항에 따라 회원에게 약관 변경 적용일까지 거부의사를 표시하지 않으면, 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 명시적으로 약관 변경에 대한 거부의사를 표시하지 않으면, 회사는 회원이 변경된 약관에 동의한 것으로 간주합니다.


제 5조 (약관 외 준칙)

(1) 이 약관에 밝히지 않은 사항은 전기통신기본법, 전기통신사업법 등 관련 법령의 규정과 일반 상관례를 따릅니다.
(2) 회사는 필요하면 특정 서비스에 적용될 사항(이하 “개별약관”)을 정하여 이를 마이플랜잇을 통하여 공지할 수 있습니다.
(3) 회사는 필요하면 서비스 이용과 관련된 세부적인 내용(이하 “이용정책”)을 정하여 이를 마이플랜잇을 통하여 공지할 수 있습니다.
(4) 개별약관이나 이용정책의 변경이 있으면 회사는 변경 내용의 효력발생일 7일 이전에 마이플랜잇을 통하여 해당 변경 사항을 공지합니다.


제 2장. 서비스 이용계약

제 6조 (이용계약의 성립)

(1) 회사가 제공하는 서비스에 관한 이용계약(이하 “이용계약”이라고 합니다.)은 서비스를 이용하고자 하는 자의 이용신청을 회사가 승낙함으로써 성립하며, 이때 서비스를 이용하고자 하는 자는 회사가 온라인으로 제공하는 회원가입 신청 양식에 따라 필요한 각각의 항목에 해당 내용을 기재한 후 이 약관에 동의한다는 의사 표시를 해야 합니다.
(2) 회원가입의 성립시기는 회사의 이용승낙 의사가 해당 서비스화면에 게시하거나, 이메일(E-mail) 또는 기타 회사가 정하는 방법으로 이용신청자에게 도달한 시점으로 합니다.
(3) 탈퇴 후 회원 재가입, 임의 해지 등을 반복하거나 다수의 ID로 가입하여 회사가 제공하는 각종 이벤트 혜택 등으로 경제적 이익을 편법으로 수취하고, 이 과정에서 명의를 무단으로 사용하는 등 편법과 불법 행위를 하는 회원을 차단하고자 회원이 탈퇴한 후 1개월이 지나지 않으면 회원의 서비스 가입신청을 거부할 수 있습니다.
(4) 단, 회원의 의사로 해지한 후 회원 재가입, 임의 해지 등을 반복적으로 행하여 경제적 이익을 편법으로 수취하거나 이 과정에서 명의를 무단으로 사용하는 등 편법과 불법 행위가 발견되지 않는다고 회사가 판단되는 경우, 회원은 1개월 내 재가입 할 수 있습니다.



제 7조 (서비스 이용 신청)

(1) 회사가 제공하는 서비스에 가입하여 이용하고자 하는 자는 회사에서 제공한 회원가입 신청양식에 따라 필요사항을 기재하여야 합니다. 회원가입 양식은 필수 기재 항목과 선택 기재 항목으로 구분 되어 있으며 필수 기재 항목은 반드시 입력 해야 합니다.
(2) 회사는 모든 회원에게 광고성 이메일(E-mail) 수신여부, 광고성 문자메시지(SMS) 수신여부, 제휴회사 및 개인정보 위탁관리회사에 대한 개인정보 제공∙이용에 대한 동의 여부를 확인할 수 있습니다.


제 8조 (이용신청의 승낙, 거부, 유보)

(1) 회사는 이 약관 제7조에서 정한 기재항목을 사실대로 정확하게 기재하고 이 약관에 동의한 자의 가입 신청에 대하여 서비스의 이용을 승낙함을 원칙으로 합니다.
(2) 회사는 다음과 같은 사유가 있으면, 이용신청에 대한 승낙을 거부할 수 있습니다.
1. 상기 제 2항의 본인확인절차에서 본인이 아님이 확인된 경우
2. 이미 가입된 회원
3. 신청, 등록 내용에 허위, 기재누락, 오기 등이 있는 경우
4. 이용계약이 해지된 날로부터 1개월 이내에 재이용신청을 하는 경우
5. 회사로부터 회원자격정지 조치 등을 받은 회원이 그 조치 기간에 이용계약을 임의 해지하고 재이용신청을 하는 경우(회원에게 재이용이 허락되더라도, 서비스 이용과정에서 본인확인 후 회원자격정지 조치를 받았던 사실이 확인되면 해당 ID의 이용계약이 해지될 수 있음)
6. 기타 이 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우
7. 마이플랜잇 이용약관의 적용을 받는 자가 해당 약관을 위반한 경우
8. 사회의 안녕질서 또는 미풍양속을 저해하거나, 저해할 목적으로 신청한 경우
(3) 회사는 다음과 같은 사유가 있으면, 이용신청에 대한 승낙을 유보할 수 있습니다. 이 때, 회사는 이용신청자에게 승낙유보의 사유, 승낙 가능 시기 또는 승낙에 필요한 추가요청정보나 자료 등 승낙유보와 관련된 사항을 해당 서비스 화면에 게시하거나 이메일(E-mail)로 통지합니다.
1. 설비에 여유가 없는 경우
2. 기술상 지장이 있는 경우
3. 회사의 본인확인절차에서 본인 여부가 확인되지 않는 경우
4. 기타 회사가 합리적인 판단으로 의하여 필요하다고 인정하는 경우


제 9조 (개인정보의 변경, 보호)

(1) 회원은 이용신청 시 기재한 사항이 변경되었을 경우에는 상당한 기간 이내에 회원정보 수정 등의 방법으로 그 변경사항을 수정하여야 합니다. 단, 이름, 아이디(ID) 등 변경할 수 없는 사항은 수정할 수 없습니다.
(2) 수정하지 않은 정보로 말미암아 발생하는 손해는 해당 회원이 부담하며, 회사는 이에 대해 아무런 책임을 지지 않습니다.
(3) 회사는 회원의 정보를 서비스를 제공하기 위한 목적 이외의 용도로 사용하거나 회원의 동의 없이 제3자에게 제공하지 않습니다. 다만 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.
(4) 회사는 관련법령이 정하는 바에 따라서 회원의 개인정보를 보호하기 위하여 노력하며, 회원의 개인정보를 보호하기 위한 정책을 수립하고 개인정보보호 책임자를 지정하여 이를 게시합니다.
(5) 회원의 개인정보보호는 관련 법령 및 회사가 정하는 개인정보처리방침에서 정한 바를 따릅니다.


제 10조 (이용계약의 종료)

(1) 회원은 다음 각호에서 정한 바에 따라 이용계약을 해지할 수 있습니다.
1. 회원은 언제든지 회사에 해지의 의사를 통지하여 이용계약을 해지할 수 있습니다. 단, 해지의사를 통지하기 전에 현재 진행 중인 모든 상품의 거래를 완료하거나 철회 또는 취소하여야 하며, 거래의 철회 또는 취소로 인한 불이익은 회원 본인이 부담하여야 합니다.
2. 회원이 해지할 때에는 회원은 회사에게 이메일(E-mail), 전화, 팩스, 기타의 방법으로 해지 사유를 밝혀 해지 의사를 통지합니다. 거래의 안전을 위하여 회사는 동일인 소유로 확인되는 회원 ID에 대하여 일괄 해지 의사를 통지할 수 있습니다. 이용계약은 회원의 해지의사를 회사에게 통지한 시점에 종료됩니다.
3. 회원의 의사로 해지한 후 회원 재가입, 임의 해지 등을 반복적으로 행하여 회사가 제공하는 각종 이벤트 혜택 등 경제적 이익을 편법으로 수취하거나 이 과정에서 명의를 무단으로 사용하는 등 편법과 불법행위를 하는 것을 차단하고자 회사는 회원에게 회원 탈퇴한 날로부터 1개월이 지나야 재가입 할 수 있게 하고 있으며 회원은 이 약관이 정하는 회원가입절차와 관련 조항에 따라 회사에 통지된 재이용 의사를 회사로부터 승낙 받은 이후에 서비스를 재이용할 수 있습니다.
4. 단, 회원의 의사로 해지한 후 회원 재가입, 임의 해지 등을 반복적으로 행하여 경제적 이익을 편법으로 수취하거나 이 과정에서 명의를 무단으로 사용하는 등 편법과 불법 행위가 발견되지 않는다고 회사가 판단되는 경우, 회원은 1개월 내 재가입 할 수 있습니다.
5. 회원 재가입, 임의해지 등을 반복적으로 행하여 회사가 제공하는 각종 이벤트 혜택 등의 경제적 이익을 편법으로 수취하거나 이 과정에서 명의를 무단으로 사용하는 등 편법과 불법 행위를 하는 것을 차단하고자 회원탈퇴 후 1개월 동안 해당 회원의 아이디, 성명, 탈퇴일자, 탈퇴사유 등 개인정보를 보관합니다.
(2) 회사는 다음 각호에서 정한 바에 따라 이용계약을 해지할 수 있습니다.
1. 회사는 회원에게 다음 각목에 해당하는 사유가 발생하거나 확인되면 이용계약을 해지할 수 있습니다.
가. 다른 회원·회사(직원·상담원 포함)의 권리나 명예, 신용 기타 정당한 이익을 침해하거나 대한민국 법령 또는 공서양속에 위배되는 행위를 한 경우
나. 서비스의 원활한 진행을 방해하거나 방해할 우려가 있는 아래의 행위 등을 하거나 시도한 경우
다. 합리적 사유 없이 상습적·악의적으로 이의를 제기하는 행위
라 그 외 회사가 정한 안전거래 이용규칙을 위반한 경우
마. 회원에게 제8조에서 정한 이용계약의 승낙거부사유가 있음이 확인된 경우
2. 회사가 해지할 때에는 회사는 회원에게 이메일(E-mail), 전화, 팩스, 기타의 방법으로 해지 사유를 밝혀 해지 의사를 통지합니다. 이용계약은 회사의 해지의사가 회원에게 도달한 시점에 종료됩니다. 단, 이메일(E-mail)을 통한 해지의사 통지의 경우 발송시점을 도달시점으로 간주합니다.
3. 본 항에서 정한 바에 따라 이용계약이 종료되면 회사는 회원의 재이용 신청을 그 승낙하지 않을 수 있습니다.
(3) 이용계약의 종료와 관련하여 발생한 손해에 대해서는 자신의 귀책사유로 이용계약이 종료된 해당 회원이 책임을 져야 하고, 회사는 귀책사유가 없는 한 책임을 지지 않습니다.


제 11조 (회원관리)

(1) 회사는 이 약관과 관계 법령의 일반원칙을 위반한 회원에게 다음과 같은 조치를 할 수 있습니다.
1. 회사가 부가적으로 제공한 혜택의 일부 또는 전부의 회수
2. 특정 서비스 이용제한
3. 이용계약의 해지
4. 손해배상의 청구
(2) 회사가 제1항 각 호에 정한 조치를 할 때는 미리 회원에게 전화 또는 이메일(E-mail)로 통보하며, 회원과의 연락이 안되거나 긴급을 요구하는 등 부득이할 때에는 해당 사항을 먼저 조치한 후 나중에 통보할 수 있습니다. 단, 신용점수 차감은 통보 없이 할 수 있습니다.
(3) 회원은 본 조에 따른 회사의 조치에 대해 항변의 사유가 있으면 항변을 할 수 있습니다.
(4) 회사는 회원이 1년 이상 로그인 하지 않으면, 휴면계정으로 간주하고 회사가 제공하는 서비스 이용을 제한할 수 있습니다. 휴면계정으로 지정된 이후 다시 서비스를 이용하려면 거래안전을 위해 회사가 정하는 본인확인 절차 등을 이행하여야 합니다.


제 3장 마이플랜잇 서비스

제 12조 (서비스 기간과 중단)

(1) 회원의 서비스 이용 기간은 회사에 서비스를 신청하여 이용승낙을 받은 날로부터 서비스 이용계약을 해지할 때까지 입니다.
(2) 회사는 컴퓨터 등 정보통신설비의 보수, 점검, 교체 및 고장, 통신의 두절 등의 사유가 발생하면 서비스를 일시적으로 중단할 수 있으며 그럴 경우 서비스 일시 중단 사실과 그 사유를 서비스 초기 화면에 통지합니다.
(3) 회사는 다음과 같은 불가항력으로 서비스를 제공할 수 없으면 서비스의 제공을 제한하거나 일시 중단할 수 있습니다.
1 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
2. 회원이 회사의 영업활동을 방해하는 경우
3. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
4. 서비스 제공업자와의 계약 종료 등과 같은 회사의 제반 사정으로 서비스를 유지할 수 없는 경우
5. 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
(4) 회사는 변경될 서비스의 내용 및 제공일자를 회원에게 통지하고 서비스를 변경하여 제공할 수 있습니다.


제 13조 (서비스 이용료)

(1) 회사는 마이플랜잇의 일부 특정 서비스나 기능을 제공할 때 이용료를 부과할 수 있습니다
(2) 본 조의 이용료는 본 조 및 개별 약관 또는 별도 신청서에서 정하는 바를 따릅니다.


제 14조 (서비스의 종류)

회사에서 회원에게 제공하는 서비스는 다음과 같습니다.
1. 커리큘럼 컨텐츠
2. 일정 관리 시스템


제 15조 (저작권 정책)

(1) 회사는 제공하는 서비스와 관련하여 저작권자의 저작권 보호를 위한 정책을 수립해 운영하며 회원은 회사의 저작권 정책을 지켜야 합니다.
(2) 회원이 회사가 제공하는 서비스를 이용하면서 작성한 각종 게시물의 저작권은 회원 본인에게 있으며, 해당 게시물의 저작권 침해를 비롯한 민·형사상 모든 책임은 회원 본인이 집니다.
(3) 회사는 회원이 등록한 게시물을 검색사이트나 다른 사이트에 노출할 수 있으며, 판촉, 홍보 및 기타의 자료로 무상으로 사용할 수 있습니다. 또한, 회사가 제공하는 서비스 내에서 회원 게시물을 복제, 전시, 전송, 배포할 수 있으며 2차적 저작물과 편집저작물로 작성 할 수 있습니다. 다만, 해당 게시물을 등록한 회원이 게시물의 삭제 또는 사용중지를 요청하면 회사는 관련 법률에 따라 보존해야 하는 사항을 제외하고 즉시 삭제 또는 사용을 중지합니다.
(4) 본 조 제3항에 언급된 회사의 사용권은 마이플랜잇 서비스를 운영하는 동안에만 확정적으로 유효합니다.
(5) 회사가 본 조 제3항 이외의 방법으로 회원의 게시물을 상업적으로 이용하고자 할 때에는, 전화, 팩스, 이메일(E-mail)등의 방법으로 미리 회원의 동의를 얻어야 합니다. 회사가 본 항에 따라 회원의 게시물을 상업적으로 이용할 때 회사는 별도의 보상제도를 운영할 수 있습니다.
(6) 회사가 작성한 저작물에 대한 저작권과 지적 재산권은 회사에 귀속합니다.
(7) 회원이 마이플랜잇을 이용하여 얻은 정보를 회사의 승낙 없이 복제, 송신, 출판, 배포, 방송, 기타 방법으로 이용하거나 제3자에게 이용하게 할 때 그에 대한 책임은 회원 본인에게 있습니다.
(8) 회원은 마이플랜잇 내에서 자신의 저작권이 침해되면 회사가 운영하는 신고센터 제도를 이용하여 자신의 정당한 권리를 보호받을 수 있습니다.
(9) 게시물의 내용이 다음 각 호의 내용을 담고 있을 때, 회사는 게시물을 삭제하거나 게시자에게 특정 서비스의 이용제한 또는 정지, 이용계약의 해지 등의 조치를 할 수 있습니다. 이때 게시물이 삭제되면 해당 게시물과 관련된 게시물(답변글, 댓글 등)도 모두 삭제됩니다.
1. 대한민국의 법령을 위반하는 내용을 포함하는 경우
2. 타인의 권리나 명예, 신용 기타 정당한 이익을 침해하는 경우
3. 정보통신기기의 오작동을 일으킬 수 있는 악성코드나 데이터를 포함하는 경우
4. 사회 공공질서나 미풍양속에 위배되는 경우
5. 기타 제1호 내지 제4호에 준하는 중대한 사유로 말미암아 회사가 제공하는 마이플랜잇 서비스의 원활한 진행을 방해하는 것으로 판단되는 경우
(10) 회사가 제9항에 따라 게시물을 삭제했을 때, 해당 게시자는 회사에 이의를 제기하여 구제받을 수 있습니다.


제 16조 (금지행위)

(1) 회사가 제공하는 서비스 이용방법을 따르지 않고 비정상적인 방법으로 서비스를 이용하거나 시스템에 접근하는 행위는 금지됩니다.
(2) 시스템 부정행위가 확인되면 회사는 해당 회원에게 부가적으로 제공한 혜택의 일부 또는 전부를 회수하거나, 특정 서비스의 이용을 제한하고, 이용계약을 해지하는 등의 조치를 할 수 있습니다.
(3) 타인의 명의, 카드정보, 계좌정보 등을 무단으로 사용하여 회사가 제공하는 구매서비스를 이용하는 행위는 금지됩니다.
(4) 회사는 회원의 부정 거래 행위(현금융통, 결제수단도용, 대량 허위거래 등)가 의심되면 일시적으로 서비스 이용을 정지하고 거래 사실 확인 및 소명을 위해 정지한 날로부터 15일 이내에 필요 최소한의 증빙자료(거래사실증명서, 물품 수급 및 발주, 배송증빙서류 등)를 요청 할 수 있습니다. 만약 특별한 사정없이 회사가 요청한 증빙자료를 정해진 기한 내에 제출하지 않거나 서류 미비 또는 소명이 되지 않을 경우 서비스 이용이 영구히 정지되거나 이용계약이 해지될 수 있습니다.
(5) 회사는 회원의 법령 위반, 본 약관 위반, 기타 금지행위 여부에 대한 모니터링을 실시하고 있으며, 회원은 회사의 모니터링 업무에 대하여 협조하여야 하며 회사가 요청하는 필요 최소한의 증빙자료를 제출할 의무가 있습니다.


제 17조 (유료서비스의 취소 및 환불)

(1) [취소 및 환불 약관]
1. 회사는 회원이 통보된 금지행위를 하였을 경우 해당 조항에 따라 서비스 이용을 제한할 수 있습니다. 해당 상황에서 회사는 회원이 구매한 유료 서비스 금액 중 첫 달 결제 금액의 50%를 공제하고 환불을 진행합니다.
2. 구매 회원의 단순 변심에 의한 환불 요청은 불가합니다. 서비스 환불 시 하단의 기준에 따라 산정된 환불액에서 결제수수료를 공제한 금액을 환불합니다.
(2) [취소 및 환불 수수료]
1. 무통장 입금 : 수수료 없음


제 4장 계약당사자의 의무

제 18조 (회사의 의무)

(1) 회사는 서비스 제공과 관련하여 취득한 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.
(2) 회사는 업무와 관련하여 회원의 사전 동의 없이 회원 전체 또는 일부의 개인정보를 행태분석은 가능하나, 특정 개인을 알아볼 수 없는 형태로 가공하여 통계자료로 사용할 수 있고, 이를 위하여 회원의 컴퓨터에 쿠키를 전송할 수 있습니다. 이 경우 회원은 쿠키의 수신을 거부하거나 쿠키의 수신에 대하여 경고하도록 사용하는 컴퓨터의 브라우저의 설정을 변경할 수 있으며, 쿠키의 설정 변경에 의해 서비스 이용이 변경되는 것은 회원의 책임입니다.
(3) 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 신속하게 처리하여야 하며, 신속한 처리가 곤란한 경우 그 사유와 처리 일정을 서비스 화면에 게재하거나 E-mail 등을 통하여 동 회원에게 통지합니다.
(4) 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우, 그러한 손해가 회사의 고의나 중과실에 기해 발생한 경우에 한하여 회사에서 책임을 부담하며, 그 책임의 범위는 통상손해에 한합니다.
(5) 회사는 정보통신망 이용촉진 및 정보보호에 관한 법률, 통신비밀보호법, 전기통신사업법 등 서비스의 운영, 유지와 관련 있는 법규를 준수합니다.


제 19조 (회원의 의무)

(1) 회원은 서비스를 이용할 때, 다음 각 호의 행위를 하여서는 아니 됩니다.
1. 이용 신청 또는 변경 시 허위 사실을 기재하거나, 다른 회원의 ID 및 비밀번호를 도용, 부정하게 사용하는 행위
2. 회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 행위
3. 타인의 명예를 손상시키거나 불이익을 주는 행위
4. 게시판 등에 음란물을 게재하거나 음란사이트를 연결(링크)하는 행위
5. 회사 또는 제3자의 저작권 등 기타 권리를 침해하는 행위
6. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형, 음성 등을 타인에게 유포하는 행위
7. 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 행위
8. 서비스 운영을 고의로 방해하거나 서비스의 안정적 운영을 방해할 수 있는 정보 및 수신자의 명시적인 수신거부의사에 반하여 광고성 정보 또는 스팸메일(Spam Mail)을 전송하는 행위
9. 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
10. 다른 회원의 개인정보를 수집, 저장, 공개하는 행위
11. 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위
12. 재물을 걸고 도박하거나 사행행위를 하는 행위
13. 윤락행위를 알선하거나 음행을 매개하는 내용의 정보를 유통시키는 행위
14. 수치심이나 혐오감 또는 공포심을 일으키는 말이나 음향, 글이나 화상 또는 영상을 계속하여 상대방에게 도달하게 하여 상대방의 일상적 생활을 방해하는 행위
15. 서비스에 게시된 정보를 변경하는 행위
16. 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 포함)의 전송 또는 게시 행위
17. 회사의 직원이나 운영자를 가장하거나 사칭하여 또는 타인의 명의를 도용하여 글을 게시하거나 E-mail을 발송하는 행위
18. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 E-mail으로 발송하는 행위
19. 스토킹(stalking) 등 다른 회원을 괴롭히는 행위
20. 기타 불법적이거나 부당한 행위
(2) 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니 됩니다.
(3) 회원은 등록정보에 변경사항이 발생할 경우 즉시 갱신하여야 합니다. 회원이 제공한 등록정보 및 갱신한 등록정보가 부정확할 경우, 기타 회원이 본 조 제1항에 명시된 행위를 한 경우에 회사는 본 서비스 약관 제10조에 의해 회원의 서비스 이용을 제한 또는 중지 할 수 있습니다.


제 20조 (회원 ID와 비밀번호 관리에 대한 의무와 책임)

(1) 회사는 사이트 내에서 일부 서비스 신청 시 이용요금을 부과할 수 있으므로, 회원은 회원 ID 및 비밀번호 관리를 철저히 하여야 합니다.
(2) 회원 ID와 비밀번호의 관리 소홀, 부정 사용에 의하여 발생하는 모든 결과에 대한 책임은 회원 본인에게 있으며, 회사의 시스템 고장 등 회사의 책임 있는 사유로 발생하는 문제에 대해서는 회사가 책임을 집니다.
(3) 회사는 회원의 안전한 개인정보보호를 위하여 1개월 이상의 주기로 비밀번호를 변경하도록 권고할 수 있으며, 이를 위한 기술적 조치를 제공할 수 있습니다.
(4) 회사는 회원의 ID와 비밀번호의 도용으로 인한 피해를 방지하기 위하여 2개월이상 비밀번호를 변경하지 않은 회원에 대해 비밀번호를 변경 후 서비스를 이용하도록 로그인(log-in)을 제한할 수 있습니다.
(5) 회사는 회원의 ID와 비밀번호의 도용으로 인한 피해를 방지하기 위하여, 사이트에 1년 이상 로그인(log-in)한 기록이 없는 ID를 휴면 ID로 정하며, 휴면 ID에 대하여 회원 휴면해제절차를 수행한 후 서비스를 이용하도록 로그인(log-in)을 제한할 수 있습니다.
(6) 회원은 본인의 회원 ID 및 비밀번호를 제3자에게 이용하게 해서는 안되며, 회원 본인의 회원 ID 및 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 인지하는 경우에는 바로 회사에 통보하고 회사의 안내가 있는 경우 그에 따라야 합니다.
(7) 회원 ID는 회사의 사전 동의 없이 변경할 수 없습니다.


제 21조 (회원에 대한 통지)

(1) 회원에 대한 통지를 하는 경우 회사는 회사가 발급한 e-mail 주소 또는 회원이 등록한 e-mail 주소 또는 SMS 등으로 할 수 있습니다.
(2) 회사는 불특정 다수 회원에 대한 통지의 경우 서비스 게시판 등에 게시함으로써 개별 통지에 갈음할 수 있습니다.


제 22조 (회원의 개인정보보호)

회사는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관한 사항은 관련법령 및 회사가 정하는 개인정보처리방침에 정한 바에 따릅니다.


제 23조 (개인정보의 위탁)

회사는 수집된 개인정보의 처리 및 관리 등의 업무(이하 업무)를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를 회사가 선정한 회사에 위탁할 수 있습니다. 개인정보의 위탁에 관한 사항은 관련법령 및 회사가 정하는 개인정보처리방침에 정한 바에 따릅니다.


제 5장 기타사항

제 24조 (손해배상)

(1) 회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 본 약관을 위반한 회원은 회사에 발생하는 모든 손해를 배상하여야 합니다.
(2) 회원이 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 회사를 면책시켜야 하며, 당해 회원은 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다.


제 25조 (회사의 면책)

(1) 제12조 제3항의 사유로 서비스를 일시적으로 중단해야 할 경우 회사는 사이트 초기 화면을 통해 공지하며, 이는 서비스 일시 중단이 불가피하거나 불가항력적인 경우이므로 회원 또는 제3자에게 손해가 발생했더라도 책임을 부담하지 않습니다.
(2) 제12조 제3항의 사유로 서비스를 제한하거나 중단하게 된다면 회사는 불가항력을 이유로 그 책임을 지지 않습니다.
(3) 회사는 회원의 귀책사유로 서비스 이용에 장애가 발생하는 것에 대해 책임을 지지 않습니다.
(4) 회원가 자신의 개인정보를 타인에게 유출하거나 제공하여 발생하는 피해에 대해 회사는 일절 책임을 지지 않습니다.
(5) 회사의 서비스 화면에서 링크, 배너 등을 통하여 연결된 회사(이하 피연결회사)와 회원간에 이루어진 거래에 회사는 개입하지 않으며, 해당 거래에 대하여 책임을 지지 않습니다.


제 26조 (준거법 및 관할법원)

(1) 이 약관과 회사와 회원 간의 서비스 이용 계약, 회원 상호 간의 물품거래에는 대한민국 법령이 적용됩니다.
(2) 이 서비스와 관련하여 회사와 회원 사이에 분쟁이 발생하여 소송이 제기되었을 때에는 민사소송법에 따라 관할법원을 정합니다.


제 27조 (기타 조항)

(1) 회사는 필요하면 특정 서비스나 기능의 전부 또는 일부를 마이플랜잇을 통해 미리 공지한 후 일시적 또는 영구적으로 수정하거나 중단할 수 있습니다.
(2) 각 당사자는 상대방의 서면 동의 없이 이 약관상의 권리와 의무를 제3자에게 양도하거나 처분할 수 없습니다.
(3) 이 약관과 관련하여 당사자 간의 합의에 따라 추가로 작성된 계약서, 협정서, 통보서 등과 회사의 정책변경, 법령의 제·개정 또는 공공기관의 고시나 지침 등에 따라 회사가 마이플랜잇 사이트를 통해 공지하는 내용도 이용계약의 일부를 구성합니다.
(4) 회사는 회원이 서비스를 이용할 때 발생할 수 있는 정당한 의견이나 불만 사항을 적극적으로 수렴하여 해결하고, 회원 상호 간의 분쟁을 조정하기 위하여 고객센터를 설치하고 운영합니다. 회사는 회원이 제기하는 각종 불만사항과 의견을 적극적으로 검토한 후 정당하다고 판단될 때에는 이를 신속하게 처리하며, 즉시 처리하기가 어려운 사항이 있으면 그 사유와 처리기간을 이메일(E-mail) 혹은 전화로 회원에게 통보 합니다.


부칙

이 약관은 2022년 5월 1일부터 시행합니다.
</pre
>`;

  return (
    <>
      <Header title="서비스 이용약관" />
      <HTMLDiv dangerouslySetInnerHTML={{ __html: HTML }} />
      {/* <Footer>
        <Button>약관 동의</Button>
      </Footer> */}
    </>
  );
}

const HTMLDiv = styled.div`
  padding: 30px 20px;
`;
const Footer = styled.div`
  position: fixed;
  width: 100%;
  height: 108px;
  left: 0px;
  bottom: 0px;
  background: #fbfbfb;
  display: flex;
  align-items: center;
  justify-content: center;
`;

const Button = styled.div`
  background: #f1efff;
  border-radius: 20px;
  width: 327px;
  height: 52px;
  display: flex;
  align-items: center;
  justify-content: center;
  font-family: "PretendardRegular";
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  line-height: 16px;
  text-align: center;
  color: #6b47fd;
`;
